import random

participants = ["Іван", "Петро", "Олександр", "Микола", "Андрій",
    "Василь", "Дмитро", "Сергій", "Олег", "Юрій",
    "Володимир", "Максим", "Роман", "Богдан", "Тарас",
    "Артем", "Віталій", "Руслан", "Євген", "Степан",
    "Марія", "Олена", "Анна", "Ірина", "Наталія",
    "Тетяна", "Катерина", "Юлія", "Оксана", "Людмила",
    "Софія", "Дарина", "Вікторія", "Аліна", "Поліна",
    "Христина", "Зоряна", "Марта", "Соломія", "Вероніка",
    "Денис", "Ігор", "Павло", "Ярослав", "Лев",
    "Кирило", "Матвій", "Тимофій", "Ростислав", "Захар",
    "Анастасія", "Валерія", "Єва", "Емілія", "Мілана",
    "Арсен", "Назар", "Давид", "Гліб", "Марк",
    "Едуард", "Станіслав", "Владислав", "Антон", "Ілля",
    "Світлана", "Ніна", "Галина", "Алла", "Любов",
    "Уляна", "Лілія", "Каріна", "Еліна", "Мирослава",
    "Остап", "Мирослав", "Орест", "Святослав", "Любомир",
    "Адам", "Лука", "Михайло", "Валентин", "Георгій",
    "Злата", "Ангеліна", "Кіра", "Діана", "Меланія",
    "Яна", "Інна", "Таїсія", "Елеонора", "Богдана"]

for i in range(1, 101):
    name = input(f"Введи ім'я учасника {i}: ")
    participants.append(name)

winner = random.choice(participants)

print("\nПереможець:")
print(winner)

winner = random.choice(names)
print("Випадково обране ім’я:", winner)