print("Бот: Привіт! Я маленький чат-бот.")
print("Напиши 'вихід', щоб завершити.\n")

while True:
    user = input("Ти: ").lower()

    if user == "привіт":
        print("Бот: Привіт 👋")

    elif user == "як справи":
        print("Бот: У мене все добре, я ж програма :)")

    elif user == "що ти вмієш":
        print("Бот: Можу відповідати на прості питання.")

    elif user == "хто тебе створив":
        print("Бот: Мене створив Іван на Python 😎")

    elif user == "вихід":
        print("Бот: До зустрічі!")
    break
else:
    print("Бот: Я поки не знаю, що відповісти.")